Tekla Open API Reference for Tekla Structures 2025
CircleAttributes Methods
The Circle.CircleAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Circle.CircleAttributes Class
Tekla.Structures.Drawing Namespace